server/tests/k6/results/load-mix/load-mix.summary.txt
     █ setup

       ✓ register 201
       ✓ login 200

     █ Delete contact

       ✓ delete 200/404

     █ Create contact

       ✓ create 201
       ✓ create schema
       ✓ delete 200/404

     █ List contacts

       ✓ list 200
       ✓ list schema

   ✓ checks.............................................................: 100.00% ✓ 322723     ✗ 0     
     data_received......................................................: 73 MB   72 kB/s
     data_sent..........................................................: 71 MB   69 kB/s
     group_duration.....................................................: avg=4.05ms   min=618.47µs   med=2.51ms   max=128.61ms p(90)=7.36ms   p(95)=10.97ms 
     http_req_blocked...................................................: avg=4.33µs   min=0s         med=3.09µs   max=37.15ms  p(90)=6.6µs    p(95)=8.63µs  
     http_req_connecting................................................: avg=290ns    min=0s         med=0s       max=37.05ms  p(90)=0s       p(95)=0s      
     http_req_duration..................................................: avg=2.85ms   min=-2109553ns med=1.77ms   max=88.08ms  p(90)=5.02ms   p(95)=7.37ms  
     ✓ { endpoint:DELETE_CONTACT }......................................: avg=2.66ms   min=62.51µs    med=1.54ms   max=81.01ms  p(90)=4.63ms   p(95)=7.63ms  
     ✓ { endpoint:GET_CONTACTS }........................................: avg=2.83ms   min=-2109553ns med=1.78ms   max=88.08ms  p(90)=4.98ms   p(95)=7.15ms  
     ✓ { endpoint:POST_CONTACT }........................................: avg=3.13ms   min=92.84µs    med=2.05ms   max=87.57ms  p(90)=5.43ms   p(95)=7.61ms  
       { expected_response:true }.......................................: avg=2.81ms   min=-2109553ns med=1.76ms   max=88.08ms  p(90)=4.95ms   p(95)=7.16ms  
     http_req_failed....................................................: 5.27%   ✓ 11836      ✗ 212468
     ✗ { endpoint:DELETE_CONTACT,phase:main,expected_response:false }...: 100.00% ✓ 11836      ✗ 0     
     ✓ { endpoint:GET_CONTACTS,phase:main,expected_response:false }.....: 0.00%   ✓ 0          ✗ 0     
     ✓ { endpoint:POST_CONTACT,phase:main,expected_response:false }.....: 0.00%   ✓ 0          ✗ 0     
     ✓ { endpoint:POST_LOGIN,phase:fallback,expected_response:false }...: 0.00%   ✓ 0          ✗ 0     
     ✓ { endpoint:POST_USERS,phase:fallback,expected_response:false }...: 0.00%   ✓ 0          ✗ 0     
     ✗ { expected_response:false }......................................: 100.00% ✓ 11836      ✗ 0     
     ✓ { phase:fallback,expected_response:false }.......................: 0.00%   ✓ 0          ✗ 0     
     ✗ { phase:main,expected_response:false }...........................: 100.00% ✓ 11836      ✗ 0     
     ✓ { phase:setup,expected_response:false }..........................: 0.00%   ✓ 0          ✗ 0     
     http_req_receiving.................................................: avg=45.83µs  min=-2874509ns med=38.53µs  max=12.85ms  p(90)=75.74µs  p(95)=93.88µs 
     http_req_sending...................................................: avg=15.29µs  min=2.44µs     med=9.1µs    max=8.7ms    p(90)=31.36µs  p(95)=43.42µs 
     http_req_tls_handshaking...........................................: avg=0s       min=0s         med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...................................................: avg=2.79ms   min=0s         med=1.71ms   max=87.94ms  p(90)=4.94ms   p(95)=7.29ms  
     http_reqs..........................................................: 224304  219.843418/s
     iteration_duration.................................................: avg=504.57ms min=500.7ms    med=503.06ms max=631.57ms p(90)=507.94ms p(95)=511.53ms
     iterations.........................................................: 163489  160.237805/s
     vus................................................................: 1       min=1        max=100 
     vus_max............................................................: 100     min=100      max=100